<?php
//返回message汇总
return array(
    'message' => array(
        '1' => '请求成功！',
        '-1' => '请求失败！',
        '-2' => '已经领取过礼物啦，不要太贪心哦。',
        '-3' => '礼物领取失败，请稍后重试！',
        '-4' => '已经完成打卡，不能继续打卡！',
        '-5' => '打卡失败，请稍后重试！',
        '-6' => '您还没有打卡资格，赶紧下单进行打卡吧！',
        '-7' => '您的打卡已失效，详情请咨询客服妹子！',
        '-8' => '提现时出现错误，请稍后重试！',
        '-9' => '打卡时出了点问题，请稍后重试！',
        '-10' => '您今天已经打过两次卡了，明天再来吧！',
        '-11' => '您今天已经打过一次卡了，邀请好友可以再打一次哟！',


        '-21' => '订单号为空',
        '-22' => '订单查询失败',
        '-23' => '订单号有误',
        '-24' => '此订单已关闭',
        '-25' => '订单超时',
        '-26' => '订单已取消',
        '-27' => '请求失败',
        '-28' => '无匹配订单',
        '-29' => '订单状态修改失败',
        '-30'=>'订单金额必须大于0',
        '-31'=>'订单超时关闭',
        '-32'=>'最短失效时间间隔必须大于5分钟',
        '-33'=>'用户验证未通过',
        '-12' => '出了一点小问题，请稍后重试！',
        '-13' => '获取商品图片信息失败！',

        '-35' => '商品已被下架，暂时无法购买哦',
    ),
);